Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.integration.browserPlugin.chromeRepository
source: Chrome Plugin
ar: إضافة Chrome
es: Plugin de Chrome
fr: Plugin Chrome
id: Plugin Chrome
it: Plugin Chrome
ja: Chromeプラグイン
ko: Chrome 플러그인
pl: Wtyczka Chrome
pt_br: Plugin do Chrome
ru: Плагин Chrome
tr: Chrome Eklentisi
uk: Плагін Chrome
vi: Plugin Chrome
zh_hans: Chrome 插件
zh_hant: Chrome 外掛

# settings.integration.browserPlugin.copyEndpoint
source: Copy Endpoint
ar: نسخ نقطة النهاية
de: Endpunkt kopieren
es: Copiar endpoint
fr: Copier le point d'accès
id: Salin Endpoint
it: Copia endpoint
ja: エンドポイントをコピー
ko: 엔드포인트 복사
nl: Eindpunt kopiëren
pl: Kopiuj punkt końcowy
pt_br: Copiar Endpoint
ru: Копировать конечную точку
tr: Uç Noktayı Kopyala
uk: Копіювати кінцеву точку
vi: Sao chép Điểm cuối
zh_hans: 复制端点
zh_hant: 複製端點

# settings.integration.browserPlugin.copyToken
source: Copy Token
ar: نسخ الرمز
de: Token kopieren
es: Copiar token
fr: Copier le jeton
id: Salin Token
it: Copia token
ja: トークンをコピー
ko: 토큰 복사
nl: Token kopiëren
pl: Kopiuj token
pt_br: Copiar Token
ru: Копировать токен
tr: Belirteci Kopyala
uk: Копіювати токен
vi: Sao chép Token
zh_hans: 复制 Token
zh_hant: 複製 Token

# settings.integration.browserPlugin.description
source: Use this endpoint with the Local API Key from Settings > Integrations > Local API Key. The key only authorizes local loopback access.
ar: استخدم نقطة النهاية هذه مع مفتاح API المحلي من الإعدادات > التكاملات > مفتاح API المحلي. المفتاح يصرح فقط بالوصول المحلي loopback.
de: Verwenden Sie diesen Endpunkt mit dem lokalen API-Schlüssel aus Einstellungen > Integrationen > Lokaler API-Schlüssel. Der Schlüssel autorisiert nur lokalen Loopback-Zugriff.
es: Usa este endpoint con la clave de API local de Ajustes > Integraciones > Clave de API local. La clave solo autoriza acceso de bucle local.
fr: Utilisez ce point d'accès avec la clé API locale depuis Réglages > Intégrations > Clé API locale. La clé n'autorise que l'accès en boucle locale.
id: Gunakan endpoint ini dengan Kunci API Lokal dari Pengaturan > Integrasi > Kunci API Lokal. Kunci hanya mengotorisasi akses loopback lokal.
it: Usa questo endpoint con la chiave API locale da Impostazioni > Integrazioni > Chiave API locale. La chiave autorizza solo l'accesso locale in loopback.
ja: 設定 > 統合 > ローカルAPIキーのエンドポイントとローカルAPIキーを使用します。キーはローカルループバックアクセスのみを許可します。
ko: 설정 > 통합 > 로컬 API 키의 엔드포인트와 로컬 API 키를 사용하세요. 키는 로컬 루프백 접근만 승인합니다.
nl: Gebruik dit eindpunt met de lokale API-sleutel uit Instellingen > Integraties > Lokale API-sleutel. De sleutel autoriseert alleen lokale loopback-toegang.
pl: Użyj tego punktu końcowego z lokalnym kluczem API z Ustawienia > Integracje > Lokalny klucz API. Klucz autoryzuje tylko dostęp lokalny.
pt_br: Use este endpoint com a Chave de API Local em Ajustes > Integrações > Chave de API Local. A chave autoriza apenas acesso local de loopback.
ru: Используйте эту конечную точку с локальным API-ключом из Настроек > Интеграции > Локальный API-ключ. Ключ авторизует только локальный доступ через loopback.
tr: Bu uç noktayı Ayarlar > Entegrasyonlar > Yerel API Anahtarı'ndaki Yerel API Anahtarı ile kullanın. Anahtar yalnızca yerel geri döngü erişimini yetkilendirir.
uk: Використовуйте цю кінцеву точку з локальним ключем API з Налаштувань > Інтеграції > Локальний ключ API. Ключ авторизує лише локальний зворотний зв'язок.
vi: Sử dụng điểm cuối này với Khóa API Cục bộ từ Cài đặt > Tích hợp > Khóa API Cục bộ. Khóa chỉ cho phép truy cập loopback cục bộ.
zh_hans: 在浏览器插件中填写 endpoint，并使用「设置 → 集成 → 本地 API Key」中的 key。该 key 只授权本机 loopback 访问。
zh_hant: 在瀏覽器外掛中使用此端點，並搭配「設定 > 整合 > 本地 API 金鑰」中的金鑰。該金鑰僅授權本機迴路存取。

# settings.integration.browserPlugin.enabled
source: Enable Browser Plugin Service
ar: تفعيل خدمة إضافة المتصفح
de: Browser-Plugin-Dienst aktivieren
es: Activar servicio de plugin de navegador
fr: Activer le service de plugin navigateur
id: Aktifkan Layanan Plugin Browser
it: Abilita servizio plugin browser
ja: ブラウザプラグインサービスを有効にする
ko: 브라우저 플러그인 서비스 활성화
nl: Browserplugin-service inschakelen
pl: Włącz usługę wtyczki przeglądarki
pt_br: Ativar Serviço do Plugin do Navegador
ru: Включить службу плагина браузера
tr: Tarayıcı Eklenti Hizmetini Etkinleştir
uk: Увімкнути службу плагіна браузера
vi: Bật Dịch vụ Plugin Trình duyệt
zh_hans: 启用浏览器插件服务
zh_hant: 啟用瀏覽器外掛服務

# settings.integration.browserPlugin.endpoint
source: Endpoint
ar: نقطة النهاية
de: Endpunkt
fr: Point d'accès
ja: エンドポイント
ko: 엔드포인트
nl: Eindpunt
pl: Punkt końcowy
ru: Конечная точка
tr: Uç Nokta
uk: Кінцева точка
vi: Điểm cuối
zh_hans: 端点
zh_hant: 端點

# settings.integration.browserPlugin.header
source: Browser Plugin
ar: إضافة المتصفح
es: Plugin de navegador
fr: Plugin navigateur
id: Plugin Browser
it: Plugin browser
ja: ブラウザプラグイン
ko: 브라우저 플러그인
pl: Wtyczka przeglądarki
pt_br: Plugin do Navegador
ru: Плагин браузера
tr: Tarayıcı Eklentisi
uk: Плагін браузера
vi: Plugin Trình duyệt
zh_hans: 浏览器插件
zh_hant: 瀏覽器外掛

# settings.integration.browserPlugin.port
source: Port
ar: المنفذ
es: Puerto
it: Porta
ja: ポート
ko: 포트
nl: Poort
pt_br: Porta
ru: Порт
uk: Порт
vi: Cổng
zh_hans: 端口
zh_hant: 連接埠

# settings.integration.browserPlugin.port.error.digitsOnly
source: Enter digits only.
ar: أدخل أرقامًا فقط.
de: Nur Ziffern eingeben.
es: Introduce solo dígitos.
fr: Saisissez uniquement des chiffres.
id: Masukkan hanya angka.
it: Inserisci solo cifre.
ja: 数字のみを入力してください。
ko: 숫자만 입력하세요.
nl: Voer alleen cijfers in.
pl: Wprowadź tylko cyfry.
pt_br: Digite apenas números.
ru: Вводите только цифры.
tr: Yalnızca rakam girin.
uk: Введіть лише цифри.
vi: Chỉ nhập chữ số.
zh_hans: 只能输入数字。
zh_hant: 只能輸入數字。

# settings.integration.browserPlugin.port.error.inUseFormat
source: Port %d is already in use. Choose another port and save again.
ar: المنفذ %d قيد الاستخدام بالفعل. اختر منفذًا آخر واحفظ مرة أخرى.
de: Port %d wird bereits verwendet. Wählen Sie einen anderen Port und speichern Sie erneut.
es: El puerto %d ya está en uso. Elige otro puerto y guarda de nuevo.
fr: Le port %d est déjà utilisé. Choisissez un autre port et enregistrez à nouveau.
id: Port %d sudah digunakan. Pilih port lain dan simpan lagi.
it: La porta %d è già in uso. Scegli un'altra porta e salva di nuovo.
ja: ポート%dはすでに使用中です。別のポートを選択して再度保存してください。
ko: 포트 %d가 이미 사용 중입니다. 다른 포트를 선택하고 다시 저장하세요.
nl: Poort %d is al in gebruik. Kies een andere poort en sla opnieuw op.
pl: Port %d jest już używany. Wybierz inny port i zapisz ponownie.
pt_br: A porta %d já está em uso. Escolha outra porta e salve novamente.
ru: Порт %d уже используется. Выберите другой порт и сохраните снова.
tr: %d portu zaten kullanımda. Başka bir port seçip tekrar kaydedin.
uk: Порт %d уже використовується. Виберіть інший порт і збережіть знову.
vi: Cổng %d đã được sử dụng. Chọn cổng khác và lưu lại.
zh_hans: 端口 %d 已被占用，请修改端口后重新保存。
zh_hant: 連接埠 %d 已被佔用。請選擇其他連接埠並重新儲存。

# settings.integration.browserPlugin.port.error.invalidFormat
source: Port %d is invalid. Use a number from 1024 to 65535.
ar: المنفذ %d غير صالح. استخدم رقمًا من 1024 إلى 65535.
de: Port %d ist ungültig. Verwenden Sie eine Zahl von 1024 bis 65535.
es: El puerto %d no es válido. Usa un número del 1024 al 65535.
fr: Le port %d est invalide. Utilisez un nombre entre 1024 et 65535.
id: Port %d tidak valid. Gunakan angka dari 1024 hingga 65535.
it: La porta %d non è valida. Usa un numero da 1024 a 65535.
ja: ポート%dは無効です。1024から65535の間の数値を使用してください。
ko: 포트 %d가 유효하지 않습니다. 1024~65535 사이의 숫자를 사용하세요.
nl: Poort %d is ongeldig. Gebruik een getal van 1024 tot 65535.
pl: Port %d jest nieprawidłowy. Użyj liczby od 1024 do 65535.
pt_br: A porta %d é inválida. Use um número de 1024 a 65535.
ru: Порт %d недопустим. Используйте число от 1024 до 65535.
tr: %d portu geçersiz. 1024 ile 65535 arasında bir sayı kullanın.
uk: Порт %d недійсний. Використовуйте число від 1024 до 65535.
vi: Cổng %d không hợp lệ. Sử dụng số từ 1024 đến 65535.
zh_hans: 端口 %d 无效，请输入 1024 到 65535。
zh_hant: 連接埠 %d 無效。請使用 1024 到 65535 之間的數字。

# settings.integration.browserPlugin.port.error.tooHigh
source: The port cannot exceed 65535.
ar: لا يمكن أن يتجاوز المنفذ 65535.
de: Der Port darf 65535 nicht überschreiten.
es: El puerto no puede superar 65535.
fr: Le port ne peut pas dépasser 65535.
id: Port tidak boleh melebihi 65535.
it: La porta non può superare 65535.
ja: ポートは65535を超えることはできません。
ko: 포트는 65535를 초과할 수 없습니다.
nl: De poort mag niet hoger zijn dan 65535.
pl: Port nie może przekraczać 65535.
pt_br: A porta não pode exceder 65535.
ru: Порт не может превышать 65535.
tr: Port 65535'i aşamaz.
uk: Порт не може перевищувати 65535.
vi: Cổng không được vượt quá 65535.
zh_hans: 端口不能大于 65535。
zh_hant: 連接埠不能超過 65535。

# settings.integration.browserPlugin.port.error.tooLow
source: The port must be at least 1024.
ar: يجب أن يكون المنفذ 1024 على الأقل.
de: Der Port muss mindestens 1024 betragen.
es: El puerto debe ser al menos 1024.
fr: Le port doit être au moins 1024.
id: Port harus minimal 1024.
it: La porta deve essere almeno 1024.
ja: ポートは少なくとも1024以上である必要があります。
ko: 포트는 최소 1024 이상이어야 합니다.
nl: De poort moet minimaal 1024 zijn.
pl: Port musi wynosić co najmniej 1024.
pt_br: A porta deve ser no mínimo 1024.
ru: Порт должен быть не менее 1024.
tr: Port en az 1024 olmalıdır.
uk: Порт має бути не менше 1024.
vi: Cổng phải ít nhất là 1024.
zh_hans: 端口不能小于 1024。
zh_hant: 連接埠必須至少為 1024。

# settings.integration.browserPlugin.port.hint
source: Valid range: 1024–65535. After changing it, update the endpoint in each browser plugin.
ar: النطاق الصالح: 1024–65535. بعد تغييره، قم بتحديث نقطة النهاية في كل إضافة متصفح.
de: Gültiger Bereich: 1024–65535. Nach der Änderung aktualisieren Sie den Endpunkt in jedem Browser-Plugin.
es: Rango válido: 1024–65535. Después de cambiarlo, actualiza el endpoint en cada plugin de navegador.
fr: Plage valide : 1024–65535. Après modification, mettez à jour le point d'accès dans chaque plugin navigateur.
id: Rentang valid: 1024–65535. Setelah mengubahnya, perbarui endpoint di setiap plugin browser.
it: Intervallo valido: 1024–65535. Dopo averla modificata, aggiorna l'endpoint in ogni plugin del browser.
ja: 有効範囲：1024～65535。変更後、各ブラウザプラグインのエンドポイントを更新してください。
ko: 유효 범위: 1024~65535. 변경 후 각 브라우저 플러그인의 엔드포인트를 업데이트하세요.
nl: Geldig bereik: 1024–65535. Werk na wijziging het eindpunt in elke browserplugin bij.
pl: Zakres: 1024–65535. Po zmianie zaktualizuj punkt końcowy w każdej wtyczce przeglądarki.
pt_br: Intervalo válido: 1024–65535. Após alterar, atualize o endpoint em cada plugin do navegador.
ru: Допустимый диапазон: 1024–65535. После изменения обновите конечную точку в каждом плагине браузера.
tr: Geçerli aralık: 1024–65535. Değiştirdikten sonra her tarayıcı eklentisindeki uç noktayı güncelleyin.
uk: Діапазон: 1024–65535. Після зміни оновіть кінцеву точку в кожному плагіні браузера.
vi: Phạm vi hợp lệ: 1024–65535. Sau khi thay đổi, cập nhật điểm cuối trong mỗi plugin trình duyệt.
zh_hans: 有效范围：1024–65535。修改后还需要同步更新各浏览器插件中的 endpoint。
zh_hant: 有效範圍：1024–65535。變更後，請同步更新每個瀏覽器外掛中的端點。

# settings.integration.browserPlugin.port.saveAndStart
source: Save & Start
ar: حفظ وبدء
de: Speichern & Starten
es: Guardar e iniciar
fr: Enregistrer et démarrer
id: Simpan & Mulai
it: Salva e avvia
ja: 保存して開始
ko: 저장 및 시작
nl: Opslaan en starten
pl: Zapisz i uruchom
pt_br: Salvar e Iniciar
ru: Сохранить и запустить
tr: Kaydet ve Başlat
uk: Зберегти та запустити
vi: Lưu & Bắt đầu
zh_hans: 保存并启动
zh_hant: 儲存並啟動

# settings.integration.browserPlugin.resetToken
source: Reset Token
ar: إعادة تعيين الرمز
de: Token zurücksetzen
es: Restablecer token
fr: Réinitialiser le jeton
it: Reimposta token
ja: トークンをリセット
ko: 토큰 재설정
nl: Token resetten
pl: Resetuj token
pt_br: Redefinir Token
ru: Сбросить токен
tr: Belirteci Sıfırla
uk: Скинути токен
vi: Đặt lại Token
zh_hans: 重置 Token
zh_hant: 重置 Token

# settings.integration.browserPlugin.safariRepository
source: Safari Plugin
ar: إضافة Safari
es: Plugin de Safari
fr: Plugin Safari
id: Plugin Safari
it: Plugin Safari
ja: Safariプラグイン
ko: Safari 플러그인
pl: Wtyczka Safari
pt_br: Plugin do Safari
ru: Плагин Safari
tr: Safari Eklentisi
uk: Плагін Safari
vi: Plugin Safari
zh_hans: Safari 插件
zh_hant: Safari 外掛

# settings.integration.browserPlugin.status
source: Status
ar: الحالة
es: Estado
fr: Statut
it: Stato
ja: ステータス
ko: 상태
pl: Stan
ru: Статус
tr: Durum
uk: Статус
vi: Trạng thái
zh_hans: 状态
zh_hant: 狀態

# settings.integration.browserPlugin.status.failed
source: Failed
ar: فشل
de: Fehlgeschlagen
es: Falló
fr: Échec
id: Gagal
it: Non riuscito
ja: 失敗
ko: 실패
nl: Mislukt
pl: Niepowodzenie
pt_br: Falhou
ru: Ошибка
tr: Başarısız
uk: Помилка
vi: Thất bại
zh_hans: 启动失败
zh_hant: 啟動失敗

# settings.integration.browserPlugin.status.failedFormat
source: Failed to start: %@
ar: فشل البدء: %@
de: Fehler beim Starten: %@
es: Error al iniciar: %@
fr: Échec du démarrage : %@
id: Gagal memulai: %@
it: Avvio non riuscito: %@
ja: 起動に失敗しました: %@
ko: 시작 실패: %@
nl: Starten mislukt: %@
pl: Nie udało się uruchomić: %@
pt_br: Falha ao iniciar: %@
ru: Не удалось запустить: %@
tr: Başlatılamadı: %@
uk: Не вдалося запустити: %@
vi: Không thể khởi động: %@
zh_hans: 启动失败：%@
zh_hant: 啟動失敗：%@

# settings.integration.browserPlugin.status.running
source: Running
ar: قيد التشغيل
de: Läuft
es: En ejecución
fr: En cours d'exécution
id: Berjalan
it: In esecuzione
ja: 実行中
ko: 실행 중
nl: Actief
pl: Uruchomiony
pt_br: Em execução
ru: Работает
tr: Çalışıyor
uk: Працює
vi: Đang chạy
zh_hans: 运行中
zh_hant: 運行中

# settings.integration.browserPlugin.status.starting
source: Starting
ar: جارٍ البدء
de: Starte
es: Iniciando
fr: Démarrage
id: Memulai
it: Avvio in corso
ja: 起動中
ko: 시작 중
nl: Starten
pl: Uruchamianie
pt_br: Iniciando
ru: Запускается
tr: Başlatılıyor
uk: Запускається
vi: Đang khởi động
zh_hans: 启动中
zh_hant: 啟動中

# settings.integration.browserPlugin.status.stopped
source: Stopped
ar: متوقف
de: Gestoppt
es: Detenido
fr: Arrêté
id: Berhenti
it: Arrestato
ja: 停止
ko: 중지됨
nl: Gestopt
pl: Zatrzymany
pt_br: Parado
ru: Остановлен
tr: Durduruldu
uk: Зупинено
vi: Đã dừng
zh_hans: 已停止
zh_hant: 已停止

# settings.integration.browserPlugin.subtitle
source: Expose Starcat context to browser extensions through a token-protected local service.
ar: عرض سياق Starcat لإضافات المتصفح من خلال خدمة محلية محمية برمز.
de: Stellen Sie Starcat-Kontext für Browsererweiterungen über einen token-geschützten lokalen Dienst bereit.
es: Expón el contexto de Starcat a las extensiones del navegador mediante un servicio local protegido por token.
fr: Exposez le contexte de Starcat aux extensions de navigateur via un service local protégé par jeton.
id: Ekspos konteks Starcat ke ekstensi browser melalui layanan lokal yang dilindungi token.
it: Esponi il contesto di Starcat alle estensioni del browser tramite un servizio locale protetto da token.
ja: トークンで保護されたローカルサービスを通じて、Starcatコンテキストをブラウザ拡張機能に公開します。
ko: 토큰으로 보호된 로컬 서비스를 통해 브라우저 확장 프로그램에 Starcat 컨텍스트를 노출합니다.
nl: Stel Starcat-context beschikbaar voor browserextensies via een met token beveiligde lokale service.
pl: Udostępnij kontekst Starcat rozszerzeniom przeglądarki przez lokalną usługę chronioną tokenem.
pt_br: Expõe o contexto do Starcat para extensões do navegador por meio de um serviço local protegido por token.
ru: Предоставьте контекст Starcat расширениям браузера через защищённый токеном локальный сервис.
tr: Starcat bağlamını, belirteç korumalı bir yerel hizmet aracılığıyla tarayıcı uzantılarına sunar.
uk: Надайте контекст Starcat розширенням браузера через локальний сервіс, захищений токеном.
vi: Hiển thị ngữ cảnh Starcat cho tiện ích mở rộng trình duyệt thông qua dịch vụ cục bộ được bảo vệ bằng token.
zh_hans: 通过带 token 保护的本机服务, 将 Starcat 上下文提供给浏览器插件。
zh_hant: 通過帶 token 保護的本機服務，將 Starcat 上下文提供給瀏覽器插件。

# settings.integration.browserPlugin.title
source: Browser Plugin
ar: إضافة المتصفح
es: Plugin de navegador
fr: Plugin navigateur
id: Plugin Browser
it: Plugin browser
ja: ブラウザプラグイン
ko: 브라우저 플러그인
pl: Wtyczka przeglądarki
pt_br: Plugin do Navegador
ru: Плагин браузера
tr: Tarayıcı Eklentisi
uk: Плагін браузера
vi: Plugin Trình duyệt
zh_hans: 浏览器插件
zh_hant: 瀏覽器插件

# settings.integration.browserPlugin.token
source: Token
ar: الرمز
fr: Jeton
ja: トークン
ko: 토큰
ru: Токен
tr: Belirteç
uk: Токен

# settings.integration.browserPlugin.tokenCopied
source: Copied
ar: تم النسخ
de: Kopiert
es: Copiado
fr: Copié
id: Disalin
it: Copiato
ja: コピーしました
ko: 복사됨
nl: Gekopieerd
pl: Skopiowano
pt_br: Copiado
ru: Скопировано
tr: Kopyalandı
uk: Скопійовано
vi: Đã sao chép
zh_hans: 已复制
zh_hant: 已複製

# settings.integration.codebaseMemory.subtitle
source: Tree-sitter index + browser-based 3D visualization
ar: فهرس Tree-sitter + تصور ثلاثي الأبعاد قائم على المتصفح
de: Tree-Sitter-Index + browserbasierte 3D-Visualisierung
es: Índice Tree-sitter + visualización 3D basada en navegador
fr: Index Tree-sitter + visualisation 3D dans le navigateur
id: Indeks Tree-sitter + visualisasi 3D berbasis browser
it: Indice Tree-sitter + visualizzazione 3D basata su browser
ja: Tree-sitterインデックス＋ブラウザベースの3Dビジュアライゼーション
ko: Tree-sitter 인덱스 + 브라우저 기반 3D 시각화
nl: Tree-sitter-index + browsergebaseerde 3D-visualisatie
pl: Indeks Tree-sitter + wizualizacja 3D w przeglądarce
pt_br: Índice Tree-sitter + visualização 3D no navegador
ru: Индекс Tree-sitter + 3D-визуализация в браузере
tr: Tree-sitter indeksi + tarayıcı tabanlı 3D görselleştirme
uk: Індекс Tree-sitter + 3D-візуалізація в браузері
vi: Chỉ mục Tree-sitter + trực quan hóa 3D dựa trên trình duyệt
zh_hans: 使用 Tree-sitter 构建索引，并通过浏览器展示 3D 可视化图谱。
zh_hant: 使用 Tree-sitter 建立索引，並透過瀏覽器展示 3D 視覺化圖譜。

# settings.integration.codeFlow.actionFailedTitle
source: CodeFlow action failed
ar: فشل إجراء CodeFlow
de: CodeFlow-Aktion fehlgeschlagen
es: La acción de CodeFlow falló
fr: Échec de l'action CodeFlow
id: Tindakan CodeFlow gagal
it: Azione CodeFlow non riuscita
ja: CodeFlowアクションに失敗しました
ko: CodeFlow 동작 실패
nl: CodeFlow-actie mislukt
pl: Akcja CodeFlow nie powiodła się
pt_br: Falha na ação do CodeFlow
ru: Ошибка действия CodeFlow
tr: CodeFlow eylemi başarısız oldu
uk: Помилка дії CodeFlow
vi: Hành động CodeFlow thất bại
zh_hans: CodeFlow 操作失败
zh_hant: CodeFlow 操作失敗

# settings.integration.codeFlow.empty
source: No CodeFlow projects exist in this directory yet.
ar: لا توجد مشاريع CodeFlow في هذا الدليل بعد.
de: In diesem Verzeichnis existieren noch keine CodeFlow-Projekte.
es: Aún no hay proyectos de CodeFlow en este directorio.
fr: Aucun projet CodeFlow n'existe encore dans ce répertoire.
id: Belum ada proyek CodeFlow di direktori ini.
it: In questa directory non esistono ancora progetti CodeFlow.
ja: このディレクトリにはまだCodeFlowプロジェクトがありません。
ko: 이 디렉토리에 아직 CodeFlow 프로젝트가 없습니다.
nl: Er zijn nog geen CodeFlow-projecten in deze map.
pl: W tym katalogu nie ma jeszcze żadnych projektów CodeFlow.
pt_br: Ainda não há projetos CodeFlow neste diretório.
ru: В этой папке ещё нет проектов CodeFlow.
tr: Bu dizinde henüz CodeFlow projesi bulunmuyor.
uk: У цьому каталозі ще немає проєктів CodeFlow.
vi: Chưa có dự án CodeFlow nào trong thư mục này.
zh_hans: 当前目录还没有 CodeFlow 生成项目。
zh_hant: 目前目錄還沒有 CodeFlow 專案。

# settings.integration.codeFlow.openPanel.prompt
source: Choose and migrate
ar: اختيار ونقل
de: Auswählen und migrieren
es: Elegir y migrar
fr: Choisir et migrer
id: Pilih dan migrasi
it: Scegli e migra
ja: 選択して移行
ko: 선택 및 마이그레이션
nl: Kies en migreer
pl: Wybierz i migruj
pt_br: Escolher e migrar
ru: Выбрать и перенести
tr: Seç ve taşı
uk: Вибрати та перенести
vi: Chọn và di chuyển
zh_hans: 选择并迁移
zh_hant: 選擇並遷移

# settings.integration.codeFlow.openPanel.title
source: Choose CodeFlow output directory
ar: اختيار دليل إخراج CodeFlow
de: CodeFlow-Ausgabeverzeichnis auswählen
es: Elige el directorio de salida de CodeFlow
fr: Choisir le répertoire de sortie CodeFlow
id: Pilih direktori output CodeFlow
it: Scegli directory di output CodeFlow
ja: CodeFlow出力ディレクトリを選択
ko: CodeFlow 출력 디렉토리 선택
nl: Kies CodeFlow-uitvoermap
pl: Wybierz katalog wyjściowy CodeFlow
pt_br: Escolher diretório de saída do CodeFlow
ru: Выберите папку вывода CodeFlow
tr: CodeFlow çıktı dizinini seçin
uk: Виберіть вихідний каталог CodeFlow
vi: Chọn thư mục đầu ra CodeFlow
zh_hans: 选择 CodeFlow 输出目录
zh_hant: 選擇 CodeFlow 輸出目錄

# settings.integration.codeFlow.outputDir.choose
source: Choose directory
ar: اختيار دليل
de: Verzeichnis auswählen
es: Elegir directorio
fr: Choisir le répertoire
id: Pilih direktori
it: Scegli directory
ja: ディレクトリを選択
ko: 디렉토리 선택
nl: Kies map
pl: Wybierz katalog
pt_br: Escolher diretório
ru: Выбрать папку
tr: Dizin seç
uk: Вибрати каталог
vi: Chọn thư mục
zh_hans: 选择目录
zh_hant: 選擇目錄

# settings.integration.codeFlow.outputDir.resetHelp
source: Migrate back to the default app-container directory
ar: نقل مرة أخرى إلى دليل حاوية التطبيق الافتراضي
de: Zurück zum Standard-App-Container-Verzeichnis migrieren
es: Volver al directorio predeterminado de la aplicación
fr: Revenir au répertoire par défaut de l'application
id: Migrasi kembali ke direktori kontainer aplikasi default
it: Torna alla directory predefinita del contenitore app
ja: デフォルトのアプリコンテナディレクトリに戻す
ko: 기본 앱 컨테이너 디렉토리로 마이그레이션
nl: Migreer terug naar de standaard app-container-map
pl: Migruj z powrotem do domyślnego katalogu aplikacji
pt_br: Migrar de volta para o diretório padrão do contêiner do app
ru: Вернуться в папку приложения по умолчанию
tr: Varsayılan uygulama kapsayıcı dizinine geri taşı
uk: Повернутися до каталогу програми за замовчуванням
vi: Di chuyển trở lại thư mục mặc định của ứng dụng
zh_hans: 迁移到 App Container 默认目录
zh_hant: 遷移到 App Container 預設目錄

# settings.integration.codeFlow.outputDir.revealHelp
source: Show in Finder
ar: إظهار في Finder
de: Im Finder anzeigen
es: Mostrar en Finder
fr: Afficher dans le Finder
id: Tampilkan di Finder
it: Mostra nel Finder
ja: Finderで表示
ko: Finder에 표시
nl: Toon in Finder
pl: Pokaż w Finderze
pt_br: Mostrar no Finder
ru: Показать в Finder
tr: Finder'da Göster
uk: Показати у Finder
vi: Hiển thị trong Finder
zh_hans: 在 Finder 中显示
zh_hant: 在 Finder 中顯示
